       01 IDENTIFIER PIC X(28)
           VALUE "Introduce el ID del cómic: ".
       01 HOUSE PIC X(35)
           VALUE "Introduce la casa desarrolladora: ".
       01 ISSUE PIC X(32)
           VALUE "Introduce el número de cómic: ".
       01 CHAR PIC X(25)
           VALUE "Introduce el superheroe: ".
       01 FULLNAME PIC X(21)
           VALUE "Introduce el nombre: ".
       01 ERROR-INVALID-ID PIC X(21)
           VALUE "ERROR: ID no válido.".
       01 TEXT-RESTAR-CREATE PIC X(51)
           VALUE "¿almacenar otro registro a la base de datos? (Y/N)".
