       IDENTIFICATION DIVISION.
       PROGRAM-ID. DELETE-RECORD.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
      * Physic file in dinamic mode.
       FILE-CONTROL.
       COPY "PHYSIC-FILE.cbl".

       DATA DIVISION.
       FILE SECTION.
       COPY "LOGIC-FILE.cbl".

       WORKING-STORAGE SECTION.
       77 DELETE-CONFIRMATION PIC X.
       77 RECORD-FOUND PIC X.
       77 ID-COMIC-FIELD PIC Z(5).

       COPY "DELETE-WS-ESP.cbl".

       PROCEDURE DIVISION.
       START-PROGRAM.
           OPEN I-O COMICS-FILE.
           PERFORM GET-COMICS-RECORDS.
           PERFORM DELETE-RECORDS
           UNTIL COMIC-ID = ZEROES.
           CLOSE COMICS-FILE.
           END-PROGRAM.
               STOP RUN.

       GET-COMICS-RECORDS.
           PERFORM INITIATE-COMICS-RECORDS.
           PERFORM GET-COMIC-ID.
           MOVE "N" TO RECORD-FOUND.
               PERFORM FIND-COMIC-RECORD
               UNTIL RECORD-FOUND = "Y" OR
               COMIC-ID = ZEROES.

       INITIATE-COMICS-RECORDS.
           MOVE SPACE TO COMIC-RECORD.
           MOVE ZEROES TO COMIC-ID.

       GET-COMIC-ID.
           DISPLAY " ".
           DISPLAY TEXT-ID-TO-DELETE.
           DISPLAY TEXT-RANGE.
           DISPLAY TEXT-ANOTHER-OPTION.
           ACCEPT ID-COMIC-FIELD.
           MOVE ID-COMIC-FIELD TO COMIC-ID.

       FIND-COMIC-RECORD.
           PERFORM READ-COMIC-RECORD.
           IF RECORD-FOUND = "N"
               DISPLAY TEXT-ERROR-NO-FOUND
           PERFORM GET-COMIC-ID.

       READ-COMIC-RECORD.
           MOVE "Y" TO RECORD-FOUND.
           READ COMICS-FILE RECORD
           INVALID KEY
           MOVE "N" TO RECORD-FOUND.
           READ COMICS-FILE RECORD WITH LOCK
           INVALID KEY
           MOVE "N" TO RECORD-FOUND.
           READ COMICS-FILE RECORD
           INVALID KEY
           MOVE "N" TO RECORD-FOUND.

       DELETE-RECORDS.
           PERFORM SHOW-ALL-FIELDS.
           MOVE "Z" TO DELETE-CONFIRMATION.
           PERFORM DELETE-QUESTION.
           IF DELETE-CONFIRMATION = "Y"
               PERFORM DELETE-RECORD.
               PERFORM GET-COMICS-RECORDS.

       SHOW-ALL-FIELDS.
           DISPLAY " ".
           DISPLAY TEXT-SHOW-ID COMIC-ID.
           DISPLAY TEXT-SHOW-HOUSE COMIC-HOUSE.
           DISPLAY TEXT-SHOW-ISSUE COMIC-ISSUE.
           DISPLAY TEXT-SHOW-CHAR COMIC-CHARACTER.
           DISPLAY TEXT-SHOW-NAME COMIC-NAME.
           DISPLAY " ".

       DELETE-QUESTION.
           DISPlAY TEXT-DELETE-QUESTION.
           ACCEPT DELETE-CONFIRMATION.
           IF DELETE-CONFIRMATION = "y"
               MOVE "Y" TO DELETE-CONFIRMATION.
           IF DELETE-CONFIRMATION = "n"
               MOVE "N" TO DELETE-CONFIRMATION.
           IF DELETE-CONFIRMATION NOT = "Y" AND
               DELETE-CONFIRMATION NOT = "N"
               DISPLAY ERROR-INPUT.

       DELETE-RECORD.
           DELETE COMICS-FILE RECORD
           INVALID KEY
           DISPLAY ERROR-CANT-DELETE.
        END PROGRAM DELETE-RECORD.
