       FD COMICS-FILE.
           01 COMIC-RECORD.
               05 COMIC-ID PIC 9(5).
               05 COMIC-HOUSE PIC X(10).
               05 COMIC-ISSUE PIC X(4).
               05 COMIC-CHARACTER PIC X(25).
               05 COMIC-NAME PIC X(25).
