       IDENTIFICATION DIVISION.
       PROGRAM-ID. READ-INDEXED-FILE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
      * Physic file in dinamic mode.
       FILE-CONTROL.
       COPY "PHYSIC-FILE.cbl".

       DATA DIVISION.
       FILE SECTION.
       COPY "LOGIC-FILE.cbl".

       WORKING-STORAGE SECTION.
       77 READ-ALL PIC X.

       PROCEDURE DIVISION.
       START-PROGRAM.
       PERFORM OPEN-FILE-PROCEDURE.
       MOVE "0" TO READ-ALL.

       PERFORM READ-NEXT-RECORD.
       IF READ-ALL = "1"
           DISPLAY "ERROR, FILE DOESNT EXIST."
       ELSE
           PERFORM SHOW-FIELDS
           UNTIL READ-ALL = "1".
           PERFORM CLOSE-FILE-PROCEDURE.
           END-PROGRAM.
            STOP RUN.

       OPEN-FILE-PROCEDURE.
           OPEN I-O COMICS-FILE.

       CLOSE-FILE-PROCEDURE.
           CLOSE COMICS-FILE.

       COPY "READ-SHOW-FIELDS-ESP.cbl".

       READ-NEXT-RECORD.
           READ COMICS-FILE NEXT RECORD
           AT END MOVE "1" TO READ-ALL.

       END PROGRAM READ-INDEXED-FILE.
