       SHOW-FIELDS.
           DISPLAY "ID: " COMIC-ID " Casa: " COMIC-HOUSE
           " Número: " COMIC-ISSUE " Superheore: " COMIC-CHARACTER
           " Nombre: " COMIC-NAME.

           PERFORM READ-NEXT-RECORD.
